Revit 2027 API
RenderingQualitySettings.IsValidRenderTime Method
 Validate the render time is between 1 and 32768.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidRenderTime(
	int value
)
Public Function IsValidRenderTime (
	value As Integer
) As Boolean
public:
bool IsValidRenderTime(
	int value
)
member IsValidRenderTime :
        value : int -> bool
Parameters
value Int32
 The render time value to validate.
Return Value
Boolean
 True if the value is in the proper range, false otherwise.
See Also
Reference
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace